In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'Salario': [30000, 45000, 38000],
                    'Antiguedad' : [9, 13, 12]},
                    index=[1, 2, 3])

df2= pd.DataFrame({'Ciudad': ['Madrid', 'Barcelona', 'Valencia'],
                   'Jerarquia': ['Baja', 'Alta', 'Media']},
                   index=[1, 2, 4])

In [3]:
df1

   Salario  Antiguedad
1    30000           9
2    45000          13
3    38000          12

In [4]:
df2

      Ciudad Jerarquia
1     Madrid      Baja
2  Barcelona      Alta
4   Valencia     Media

In [5]:
df_unido= df1.join(df2)
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta
3    38000          12        NaN       NaN

In [6]:
df_unido = df1.join(df2, how = 'inner')
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta

In [7]:
df_unido = df1.join(df2, how = 'right')
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1  30000.0         9.0     Madrid      Baja
2  45000.0        13.0  Barcelona      Alta
4      NaN         NaN   Valencia     Media

In [8]:
df_unido = df1.join(df2, how = 'left')
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta
3    38000          12        NaN       NaN

Ejercicio

In [9]:
productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
}).set_index('ProductoID')

categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2],
    'NombreCategoria': ['Categoría 1', 'Categoría 2']
}).set_index('CategoriaID')

In [10]:
productos_df

                Nombre  Precio
ProductoID
1           Producto 1     100
2           Producto 2     150
3           Producto 3     200
4           Producto 4     250

In [11]:
categorias_df

            NombreCategoria
CategoriaID
1               Categoría 1
2               Categoría 2

In [12]:
df_combinado = productos_df.join(categorias_df)
df_combinado

                Nombre  Precio NombreCategoria
ProductoID
1           Producto 1     100     Categoría 1
2           Producto 2     150     Categoría 2
3           Producto 3     200             NaN
4           Producto 4     250             NaN

Ejercicio

In [14]:
productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
})

productos_df = productos_df.set_index('ProductoID')

categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2, 3],
    'NombreCategoria': ['Categoría 1', 'Categoría 2', 'Categoría 3']
}).set_index('CategoriaID')

In [15]:
productos_df

                Nombre  Precio
ProductoID
1           Producto 1     100
2           Producto 2     150
3           Producto 3     200
4           Producto 4     250

In [16]:
categorias_df

            NombreCategoria
CategoriaID
1               Categoría 1
2               Categoría 2
3               Categoría 3

In [20]:
df_combinado = categorias_df.join(productos_df, how='right')
df_combinado

           NombreCategoria      Nombre  Precio
ProductoID
1              Categoría 1  Producto 1     100
2              Categoría 2  Producto 2     150
3              Categoría 3  Producto 3     200
4                      NaN  Producto 4     250

In [21]:
df_combinado = categorias_df.join(productos_df, how='outer')
df_combinado

  NombreCategoria      Nombre  Precio
1     Categoría 1  Producto 1     100
2     Categoría 2  Producto 2     150
3     Categoría 3  Producto 3     200
4             NaN  Producto 4     250